callout/src/test/resources/test-data/sample-soap-message-1.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
    xmlns:ns1="http://mybank.com/20180223/Customer"
    xmlns:ns2="http://mybank.com/20180223/common"
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ns1:AccountCheck>
      <ns1:AccountCheckRequest>
        <ns2:CorrelationId>test</ns2:CorrelationId>
        <ns2:Channel>Internet</ns2:Channel>
        <ns2:ClientUserId>test_user</ns2:ClientUserId>
        <ns2:ApplicationId>InternetBanking</ns2:ApplicationId>
        <ns2:RequestDateTime>2008-11-15T09:52:58</ns2:RequestDateTime>
        <ns1:Tin>111111111</ns1:Tin>
      </ns1:AccountCheckRequest>
    </ns1:AccountCheck>
  </soap:Body>
</soap:Envelope>
